---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.FlexDuct
source: html/39e3bd3a-8304-7785-dd10-4043aa0d7da4.htm
---
# Autodesk.Revit.DB.Mechanical.FlexDuct

A flex duct in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class FlexDuct : MEPCurve
```